loadtest/tmp-prod-100vu-gzip/summary.txt

         /\      Grafana   /‾‾/  
    /\  /  \     |\  __   /  /   
   /  \/    \    | |/ /  /   ‾‾\ 
  /          \   |   (  |  (‾)  |
 / __________ \  |_|\_\  \_____/ 


     execution: local
        script: loadtest/k6-browse.js
        output: -

     scenarios: (100.00%) 1 scenario, 100 max VUs, 2m50s max duration (incl. graceful stop):
              * default: Up to 100 looping VUs for 2m20s over 3 stages (gracefulRampDown: 30s, gracefulStop: 30s)


running (0m01.0s), 004/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 004/100 VUs  0m01.0s/2m20.0s

running (0m02.0s), 007/100 VUs, 0 complete and 0 interrupted iterations
default   [   1% ] 007/100 VUs  0m02.0s/2m20.0s

running (0m03.0s), 010/100 VUs, 0 complete and 0 interrupted iterations
default   [   2% ] 010/100 VUs  0m03.0s/2m20.0s

running (0m04.0s), 014/100 VUs, 0 complete and 0 interrupted iterations
default   [   3% ] 014/100 VUs  0m04.0s/2m20.0s

running (0m05.0s), 017/100 VUs, 0 complete and 0 interrupted iterations
default   [   4% ] 017/100 VUs  0m05.0s/2m20.0s

running (0m06.0s), 020/100 VUs, 2 complete and 0 interrupted iterations
default   [   4% ] 020/100 VUs  0m06.0s/2m20.0s

running (0m07.0s), 023/100 VUs, 3 complete and 0 interrupted iterations
default   [   5% ] 023/100 VUs  0m07.0s/2m20.0s

running (0m08.0s), 027/100 VUs, 4 complete and 0 interrupted iterations
default   [   6% ] 027/100 VUs  0m08.0s/2m20.0s

running (0m09.0s), 030/100 VUs, 5 complete and 0 interrupted iterations
default   [   6% ] 030/100 VUs  0m09.0s/2m20.0s

running (0m10.0s), 033/100 VUs, 6 complete and 0 interrupted iterations
default   [   7% ] 033/100 VUs  0m10.0s/2m20.0s

running (0m11.0s), 037/100 VUs, 7 complete and 0 interrupted iterations
default   [   8% ] 037/100 VUs  0m11.0s/2m20.0s

running (0m12.0s), 040/100 VUs, 10 complete and 0 interrupted iterations
default   [   9% ] 040/100 VUs  0m12.0s/2m20.0s

running (0m13.0s), 043/100 VUs, 13 complete and 0 interrupted iterations
default   [   9% ] 043/100 VUs  0m13.0s/2m20.0s

running (0m14.0s), 047/100 VUs, 16 complete and 0 interrupted iterations
default   [  10% ] 047/100 VUs  0m14.0s/2m20.0s

running (0m15.0s), 050/100 VUs, 22 complete and 0 interrupted iterations
default   [  11% ] 050/100 VUs  0m15.0s/2m20.0s

running (0m16.0s), 053/100 VUs, 25 complete and 0 interrupted iterations
default   [  11% ] 053/100 VUs  0m16.0s/2m20.0s

running (0m17.0s), 056/100 VUs, 29 complete and 0 interrupted iterations
default   [  12% ] 056/100 VUs  0m17.0s/2m20.0s

running (0m18.0s), 060/100 VUs, 35 complete and 0 interrupted iterations
default   [  13% ] 060/100 VUs  0m18.0s/2m20.0s

running (0m19.0s), 063/100 VUs, 42 complete and 0 interrupted iterations
default   [  14% ] 063/100 VUs  0m19.0s/2m20.0s

running (0m20.0s), 066/100 VUs, 48 complete and 0 interrupted iterations
default   [  14% ] 066/100 VUs  0m20.0s/2m20.0s

running (0m21.0s), 070/100 VUs, 54 complete and 0 interrupted iterations
default   [  15% ] 070/100 VUs  0m21.0s/2m20.0s

running (0m22.0s), 073/100 VUs, 61 complete and 0 interrupted iterations
default   [  16% ] 073/100 VUs  0m22.0s/2m20.0s

running (0m23.0s), 076/100 VUs, 71 complete and 0 interrupted iterations
default   [  16% ] 076/100 VUs  0m23.0s/2m20.0s

running (0m24.0s), 080/100 VUs, 79 complete and 0 interrupted iterations
default   [  17% ] 080/100 VUs  0m24.0s/2m20.0s

running (0m25.0s), 083/100 VUs, 85 complete and 0 interrupted iterations
default   [  18% ] 083/100 VUs  0m25.0s/2m20.0s

running (0m26.0s), 086/100 VUs, 92 complete and 0 interrupted iterations
default   [  19% ] 086/100 VUs  0m26.0s/2m20.0s

running (0m27.0s), 089/100 VUs, 98 complete and 0 interrupted iterations
default   [  19% ] 089/100 VUs  0m27.0s/2m20.0s

running (0m28.0s), 093/100 VUs, 100 complete and 0 interrupted iterations
default   [  20% ] 093/100 VUs  0m28.0s/2m20.0s

running (0m29.0s), 096/100 VUs, 111 complete and 0 interrupted iterations
default   [  21% ] 096/100 VUs  0m29.0s/2m20.0s

running (0m30.0s), 099/100 VUs, 120 complete and 0 interrupted iterations
default   [  21% ] 099/100 VUs  0m30.0s/2m20.0s

running (0m31.0s), 100/100 VUs, 132 complete and 0 interrupted iterations
default   [  22% ] 100/100 VUs  0m31.0s/2m20.0s

running (0m32.0s), 100/100 VUs, 144 complete and 0 interrupted iterations
default   [  23% ] 100/100 VUs  0m32.0s/2m20.0s

running (0m33.0s), 100/100 VUs, 150 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m33.0s/2m20.0s

running (0m34.0s), 100/100 VUs, 161 complete and 0 interrupted iterations
default   [  24% ] 100/100 VUs  0m34.0s/2m20.0s

running (0m35.0s), 100/100 VUs, 171 complete and 0 interrupted iterations
default   [  25% ] 100/100 VUs  0m35.0s/2m20.0s

running (0m36.0s), 100/100 VUs, 186 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m36.0s/2m20.0s

running (0m37.0s), 100/100 VUs, 192 complete and 0 interrupted iterations
default   [  26% ] 100/100 VUs  0m37.0s/2m20.0s

running (0m38.0s), 100/100 VUs, 207 complete and 0 interrupted iterations
default   [  27% ] 100/100 VUs  0m38.0s/2m20.0s

running (0m39.0s), 100/100 VUs, 222 complete and 0 interrupted iterations
default   [  28% ] 100/100 VUs  0m39.0s/2m20.0s

running (0m40.0s), 100/100 VUs, 235 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m40.0s/2m20.0s

running (0m41.0s), 100/100 VUs, 243 complete and 0 interrupted iterations
default   [  29% ] 100/100 VUs  0m41.0s/2m20.0s

running (0m42.0s), 100/100 VUs, 256 complete and 0 interrupted iterations
default   [  30% ] 100/100 VUs  0m42.0s/2m20.0s

running (0m43.0s), 100/100 VUs, 265 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m43.0s/2m20.0s

running (0m44.0s), 100/100 VUs, 274 complete and 0 interrupted iterations
default   [  31% ] 100/100 VUs  0m44.0s/2m20.0s

running (0m45.0s), 100/100 VUs, 287 complete and 0 interrupted iterations
default   [  32% ] 100/100 VUs  0m45.0s/2m20.0s

running (0m46.0s), 100/100 VUs, 301 complete and 0 interrupted iterations
default   [  33% ] 100/100 VUs  0m46.0s/2m20.0s

running (0m47.0s), 100/100 VUs, 306 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m47.0s/2m20.0s

running (0m48.0s), 100/100 VUs, 316 complete and 0 interrupted iterations
default   [  34% ] 100/100 VUs  0m48.0s/2m20.0s

running (0m49.0s), 100/100 VUs, 324 complete and 0 interrupted iterations
default   [  35% ] 100/100 VUs  0m49.0s/2m20.0s

running (0m50.0s), 100/100 VUs, 340 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m50.0s/2m20.0s

running (0m51.0s), 100/100 VUs, 351 complete and 0 interrupted iterations
default   [  36% ] 100/100 VUs  0m51.0s/2m20.0s

running (0m52.0s), 100/100 VUs, 359 complete and 0 interrupted iterations
default   [  37% ] 100/100 VUs  0m52.0s/2m20.0s

running (0m53.0s), 100/100 VUs, 367 complete and 0 interrupted iterations
default   [  38% ] 100/100 VUs  0m53.0s/2m20.0s

running (0m54.0s), 100/100 VUs, 383 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m54.0s/2m20.0s

running (0m55.0s), 100/100 VUs, 396 complete and 0 interrupted iterations
default   [  39% ] 100/100 VUs  0m55.0s/2m20.0s

running (0m56.0s), 100/100 VUs, 405 complete and 0 interrupted iterations
default   [  40% ] 100/100 VUs  0m56.0s/2m20.0s

running (0m57.0s), 100/100 VUs, 419 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m57.0s/2m20.0s

running (0m58.0s), 100/100 VUs, 430 complete and 0 interrupted iterations
default   [  41% ] 100/100 VUs  0m58.0s/2m20.0s

running (0m59.0s), 100/100 VUs, 438 complete and 0 interrupted iterations
default   [  42% ] 100/100 VUs  0m59.0s/2m20.0s

running (1m00.0s), 100/100 VUs, 450 complete and 0 interrupted iterations
default   [  43% ] 100/100 VUs  1m00.0s/2m20.0s

running (1m01.0s), 100/100 VUs, 462 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m01.0s/2m20.0s

running (1m02.0s), 100/100 VUs, 476 complete and 0 interrupted iterations
default   [  44% ] 100/100 VUs  1m02.0s/2m20.0s

running (1m03.0s), 100/100 VUs, 486 complete and 0 interrupted iterations
default   [  45% ] 100/100 VUs  1m03.0s/2m20.0s

running (1m04.0s), 100/100 VUs, 498 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m04.0s/2m20.0s

running (1m05.0s), 100/100 VUs, 507 complete and 0 interrupted iterations
default   [  46% ] 100/100 VUs  1m05.0s/2m20.0s

running (1m06.0s), 100/100 VUs, 519 complete and 0 interrupted iterations
default   [  47% ] 100/100 VUs  1m06.0s/2m20.0s

running (1m07.0s), 100/100 VUs, 532 complete and 0 interrupted iterations
default   [  48% ] 100/100 VUs  1m07.0s/2m20.0s

running (1m08.0s), 100/100 VUs, 544 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m08.0s/2m20.0s

running (1m09.0s), 100/100 VUs, 553 complete and 0 interrupted iterations
default   [  49% ] 100/100 VUs  1m09.0s/2m20.0s

running (1m10.0s), 100/100 VUs, 565 complete and 0 interrupted iterations
default   [  50% ] 100/100 VUs  1m10.0s/2m20.0s

running (1m11.0s), 100/100 VUs, 574 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m11.0s/2m20.0s

running (1m12.0s), 100/100 VUs, 587 complete and 0 interrupted iterations
default   [  51% ] 100/100 VUs  1m12.0s/2m20.0s

running (1m13.0s), 100/100 VUs, 601 complete and 0 interrupted iterations
default   [  52% ] 100/100 VUs  1m13.0s/2m20.0s

running (1m14.0s), 100/100 VUs, 616 complete and 0 interrupted iterations
default   [  53% ] 100/100 VUs  1m14.0s/2m20.0s

running (1m15.0s), 100/100 VUs, 627 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m15.0s/2m20.0s

running (1m16.0s), 100/100 VUs, 636 complete and 0 interrupted iterations
default   [  54% ] 100/100 VUs  1m16.0s/2m20.0s

running (1m17.0s), 100/100 VUs, 642 complete and 0 interrupted iterations
default   [  55% ] 100/100 VUs  1m17.0s/2m20.0s

running (1m18.0s), 100/100 VUs, 657 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m18.0s/2m20.0s

running (1m19.0s), 100/100 VUs, 664 complete and 0 interrupted iterations
default   [  56% ] 100/100 VUs  1m19.0s/2m20.0s

running (1m20.0s), 100/100 VUs, 674 complete and 0 interrupted iterations
default   [  57% ] 100/100 VUs  1m20.0s/2m20.0s

running (1m21.0s), 100/100 VUs, 683 complete and 0 interrupted iterations
default   [  58% ] 100/100 VUs  1m21.0s/2m20.0s

running (1m22.0s), 100/100 VUs, 691 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m22.0s/2m20.0s

running (1m23.0s), 100/100 VUs, 705 complete and 0 interrupted iterations
default   [  59% ] 100/100 VUs  1m23.0s/2m20.0s

running (1m24.0s), 100/100 VUs, 716 complete and 0 interrupted iterations
default   [  60% ] 100/100 VUs  1m24.0s/2m20.0s

running (1m25.0s), 100/100 VUs, 727 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m25.0s/2m20.0s

running (1m26.0s), 100/100 VUs, 736 complete and 0 interrupted iterations
default   [  61% ] 100/100 VUs  1m26.0s/2m20.0s

running (1m27.0s), 100/100 VUs, 750 complete and 0 interrupted iterations
default   [  62% ] 100/100 VUs  1m27.0s/2m20.0s

running (1m28.0s), 100/100 VUs, 760 complete and 0 interrupted iterations
default   [  63% ] 100/100 VUs  1m28.0s/2m20.0s

running (1m29.0s), 100/100 VUs, 772 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m29.0s/2m20.0s

running (1m30.0s), 100/100 VUs, 780 complete and 0 interrupted iterations
default   [  64% ] 100/100 VUs  1m30.0s/2m20.0s

running (1m31.0s), 100/100 VUs, 789 complete and 0 interrupted iterations
default   [  65% ] 100/100 VUs  1m31.0s/2m20.0s

running (1m32.0s), 100/100 VUs, 805 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m32.0s/2m20.0s

running (1m33.0s), 100/100 VUs, 818 complete and 0 interrupted iterations
default   [  66% ] 100/100 VUs  1m33.0s/2m20.0s

running (1m34.0s), 100/100 VUs, 828 complete and 0 interrupted iterations
default   [  67% ] 100/100 VUs  1m34.0s/2m20.0s

running (1m35.0s), 100/100 VUs, 844 complete and 0 interrupted iterations
default   [  68% ] 100/100 VUs  1m35.0s/2m20.0s

running (1m36.0s), 100/100 VUs, 853 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m36.0s/2m20.0s

running (1m37.0s), 100/100 VUs, 867 complete and 0 interrupted iterations
default   [  69% ] 100/100 VUs  1m37.0s/2m20.0s

running (1m38.0s), 100/100 VUs, 877 complete and 0 interrupted iterations
default   [  70% ] 100/100 VUs  1m38.0s/2m20.0s

running (1m39.0s), 100/100 VUs, 885 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m39.0s/2m20.0s

running (1m40.0s), 100/100 VUs, 899 complete and 0 interrupted iterations
default   [  71% ] 100/100 VUs  1m40.0s/2m20.0s

running (1m41.0s), 100/100 VUs, 908 complete and 0 interrupted iterations
default   [  72% ] 100/100 VUs  1m41.0s/2m20.0s

running (1m42.0s), 100/100 VUs, 917 complete and 0 interrupted iterations
default   [  73% ] 100/100 VUs  1m42.0s/2m20.0s

running (1m43.0s), 100/100 VUs, 926 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m43.0s/2m20.0s

running (1m44.0s), 100/100 VUs, 937 complete and 0 interrupted iterations
default   [  74% ] 100/100 VUs  1m44.0s/2m20.0s

running (1m45.0s), 100/100 VUs, 947 complete and 0 interrupted iterations
default   [  75% ] 100/100 VUs  1m45.0s/2m20.0s

running (1m46.0s), 100/100 VUs, 962 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m46.0s/2m20.0s

running (1m47.0s), 100/100 VUs, 977 complete and 0 interrupted iterations
default   [  76% ] 100/100 VUs  1m47.0s/2m20.0s

running (1m48.0s), 100/100 VUs, 991 complete and 0 interrupted iterations
default   [  77% ] 100/100 VUs  1m48.0s/2m20.0s

running (1m49.0s), 100/100 VUs, 1003 complete and 0 interrupted iterations
default   [  78% ] 100/100 VUs  1m49.0s/2m20.0s

running (1m50.0s), 100/100 VUs, 1013 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m50.0s/2m20.0s

running (1m51.0s), 100/100 VUs, 1026 complete and 0 interrupted iterations
default   [  79% ] 100/100 VUs  1m51.0s/2m20.0s

running (1m52.0s), 100/100 VUs, 1035 complete and 0 interrupted iterations
default   [  80% ] 100/100 VUs  1m52.0s/2m20.0s

running (1m53.0s), 100/100 VUs, 1045 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m53.0s/2m20.0s

running (1m54.0s), 100/100 VUs, 1056 complete and 0 interrupted iterations
default   [  81% ] 100/100 VUs  1m54.0s/2m20.0s

running (1m55.0s), 100/100 VUs, 1069 complete and 0 interrupted iterations
default   [  82% ] 100/100 VUs  1m55.0s/2m20.0s

running (1m56.0s), 100/100 VUs, 1081 complete and 0 interrupted iterations
default   [  83% ] 100/100 VUs  1m56.0s/2m20.0s

running (1m57.0s), 100/100 VUs, 1090 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m57.0s/2m20.0s

running (1m58.0s), 100/100 VUs, 1102 complete and 0 interrupted iterations
default   [  84% ] 100/100 VUs  1m58.0s/2m20.0s

running (1m59.0s), 100/100 VUs, 1107 complete and 0 interrupted iterations
default   [  85% ] 100/100 VUs  1m59.0s/2m20.0s

running (2m00.0s), 100/100 VUs, 1119 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m00.0s/2m20.0s

running (2m01.0s), 100/100 VUs, 1143 complete and 0 interrupted iterations
default   [  86% ] 100/100 VUs  2m01.0s/2m20.0s

running (2m02.0s), 100/100 VUs, 1158 complete and 0 interrupted iterations
default   [  87% ] 100/100 VUs  2m02.0s/2m20.0s

running (2m03.0s), 099/100 VUs, 1169 complete and 0 interrupted iterations
default   [  88% ] 099/100 VUs  2m03.0s/2m20.0s

running (2m04.0s), 099/100 VUs, 1179 complete and 0 interrupted iterations
default   [  89% ] 099/100 VUs  2m04.0s/2m20.0s

running (2m05.0s), 097/100 VUs, 1189 complete and 0 interrupted iterations
default   [  89% ] 097/100 VUs  2m05.0s/2m20.0s

running (2m06.0s), 095/100 VUs, 1199 complete and 0 interrupted iterations
default   [  90% ] 095/100 VUs  2m06.0s/2m20.0s

running (2m07.0s), 092/100 VUs, 1205 complete and 0 interrupted iterations
default   [  91% ] 092/100 VUs  2m07.0s/2m20.0s

running (2m08.0s), 085/100 VUs, 1215 complete and 0 interrupted iterations
default   [  91% ] 085/100 VUs  2m08.0s/2m20.0s

running (2m09.0s), 081/100 VUs, 1227 complete and 0 interrupted iterations
default   [  92% ] 081/100 VUs  2m09.0s/2m20.0s

running (2m10.0s), 074/100 VUs, 1239 complete and 0 interrupted iterations
default   [  93% ] 074/100 VUs  2m10.0s/2m20.0s

running (2m11.0s), 069/100 VUs, 1253 complete and 0 interrupted iterations
default   [  94% ] 069/100 VUs  2m11.0s/2m20.0s

running (2m12.0s), 064/100 VUs, 1263 complete and 0 interrupted iterations
default   [  94% ] 064/100 VUs  2m12.0s/2m20.0s

running (2m13.0s), 054/100 VUs, 1275 complete and 0 interrupted iterations
default   [  95% ] 054/100 VUs  2m13.0s/2m20.0s

running (2m14.0s), 052/100 VUs, 1280 complete and 0 interrupted iterations
default   [  96% ] 052/100 VUs  2m14.0s/2m20.0s

running (2m15.0s), 047/100 VUs, 1288 complete and 0 interrupted iterations
default   [  96% ] 047/100 VUs  2m15.0s/2m20.0s

running (2m16.0s), 046/100 VUs, 1291 complete and 0 interrupted iterations
default   [  97% ] 046/100 VUs  2m16.0s/2m20.0s

running (2m17.0s), 039/100 VUs, 1301 complete and 0 interrupted iterations
default   [  98% ] 039/100 VUs  2m17.0s/2m20.0s

running (2m18.0s), 037/100 VUs, 1305 complete and 0 interrupted iterations
default   [  99% ] 037/100 VUs  2m18.0s/2m20.0s

running (2m19.0s), 037/100 VUs, 1305 complete and 0 interrupted iterations
default   [  99% ] 037/100 VUs  2m19.0s/2m20.0s

running (2m20.0s), 031/100 VUs, 1311 complete and 0 interrupted iterations
default   [ 100% ] 031/100 VUs  2m20.0s/2m20.0s

running (2m21.0s), 025/100 VUs, 1317 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m22.0s), 018/100 VUs, 1324 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m23.0s), 014/100 VUs, 1328 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m24.0s), 012/100 VUs, 1330 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m25.0s), 011/100 VUs, 1331 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m26.0s), 010/100 VUs, 1332 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m27.0s), 005/100 VUs, 1337 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m28.0s), 002/100 VUs, 1340 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s

running (2m29.0s), 001/100 VUs, 1341 complete and 0 interrupted iterations
default ↓ [ 100% ] 031/100 VUs  2m20s


  █ THRESHOLDS 

    http_req_duration{group:::categoria}
    ✓ 'p(95)<1500' p(95)=409.21ms
    ✓ 'p(99)<2500' p(99)=528.76ms

    http_req_duration{group:::categorias_listado}
    ✓ 'p(95)<1200' p(95)=330.57ms
    ✓ 'p(99)<2000' p(99)=567.32ms

    http_req_duration{group:::checkout_shell}
    ✓ 'p(95)<1500' p(95)=388ms
    ✓ 'p(99)<2500' p(99)=538.43ms

    http_req_duration{group:::home}
    ✓ 'p(95)<1500' p(95)=413.8ms
    ✓ 'p(99)<2500' p(99)=702.18ms

    http_req_duration{group:::listado_productos}
    ✓ 'p(95)<1500' p(95)=428.11ms
    ✓ 'p(99)<2500' p(99)=606.8ms

    http_req_duration{group:::paginas_estaticas}
    ✓ 'p(95)<800' p(95)=399.8ms
    ✓ 'p(99)<1500' p(99)=644.91ms

    http_req_duration{group:::producto}
    ✓ 'p(95)<1200' p(95)=372.67ms
    ✓ 'p(99)<2000' p(99)=626.95ms

    http_req_failed
    ✓ 'rate<0.01' rate=0.00%

    solicitudes_a_rutas_prohibidas
    ✓ 'count==0' count=0


  █ TOTAL RESULTS 

    checks_total.......: 13698   91.809436/s
    checks_succeeded...: 100.00% 13698 out of 13698
    checks_failed......: 0.00%   0 out of 13698

    ✓ status es 200
    ✓ no es 5xx
    ✓ respuesta no vacía

    CUSTOM
    cliente_descarga...................: avg=64.03ms  min=1.07ms  med=48.25ms  max=727.2ms  p(90)=106.26ms p(95)=150.62ms p(99)=268.01ms
    cliente_dns_bloqueo................: avg=4.03ms   min=0s      med=0s       max=594.73ms p(90)=0s       p(95)=0s       p(99)=171.69ms
    cliente_tcp_conexion...............: avg=1.21ms   min=0s      med=0s       max=293.07ms p(90)=0s       p(95)=0s       p(99)=45.21ms 
    cliente_tiempo_total...............: avg=171.29ms min=81.46ms med=135.39ms max=1.26s    p(90)=271.04ms p(95)=403.47ms p(99)=628.04ms
    cliente_tls_handshake..............: avg=2.82ms   min=0s      med=0s       max=398.01ms p(90)=0s       p(95)=0s       p(99)=122.53ms
    cliente_ttfb_espera................: avg=107.17ms min=61.46ms med=81.46ms  max=1.21s    p(90)=167.21ms p(95)=258.38ms p(99)=440.13ms
    http_estado_2xx....................: 4566   30.603145/s
    solicitudes_a_rutas_prohibidas.....: 0      0/s
    vercel_cache_hit...................: 4439   29.751941/s
    vercel_cache_hit_categoria.........: 591    3.961117/s
    vercel_cache_hit_categorias........: 247    1.655492/s
    vercel_cache_hit_checkout..........: 104    0.697049/s
    vercel_cache_hit_home..............: 1341   8.987915/s
    vercel_cache_hit_producto..........: 1070   7.171565/s
    vercel_cache_hit_products..........: 954    6.394087/s
    vercel_cache_miss..................: 127    0.851204/s
    vercel_cache_miss_categoria........: 12     0.080429/s
    vercel_cache_miss_categorias.......: 1      0.006702/s
    vercel_cache_miss_checkout.........: 1      0.006702/s
    vercel_cache_miss_home.............: 1      0.006702/s
    vercel_cache_miss_producto.........: 108    0.723859/s
    vercel_cache_miss_products.........: 1      0.006702/s

    HTTP
    http_req_duration..................: avg=171.29ms min=81.46ms med=135.39ms max=1.26s    p(90)=271.04ms p(95)=403.47ms p(99)=628.04ms
      { expected_response:true }.......: avg=171.29ms min=81.46ms med=135.39ms max=1.26s    p(90)=271.04ms p(95)=403.47ms p(99)=628.04ms
      { group:::categoria }............: avg=164.35ms min=83.54ms med=130.85ms max=965.3ms  p(90)=245.14ms p(95)=409.21ms p(99)=528.76ms
      { group:::categorias_listado }...: avg=165.16ms min=88.55ms med=133.4ms  max=757.24ms p(90)=261.84ms p(95)=330.57ms p(99)=567.32ms
      { group:::checkout_shell }.......: avg=168.27ms min=95.57ms med=133.83ms max=569.29ms p(90)=262.76ms p(95)=388ms    p(99)=538.43ms
      { group:::home }.................: avg=173.35ms min=81.72ms med=136.31ms max=989.38ms p(90)=277.03ms p(95)=413.8ms  p(99)=702.18ms
      { group:::listado_productos }....: avg=176.02ms min=87.57ms med=135.71ms max=1.14s    p(90)=288.26ms p(95)=428.11ms p(99)=606.8ms 
      { group:::paginas_estaticas }....: avg=176.88ms min=93.68ms med=133.27ms max=1.26s    p(90)=270.27ms p(95)=399.8ms  p(99)=644.91ms
      { group:::producto }.............: avg=169.57ms min=81.46ms med=136.95ms max=1.12s    p(90)=259.56ms p(95)=372.67ms p(99)=626.95ms
    http_req_failed....................: 0.00%  0 out of 4566
    http_reqs..........................: 4566   30.603145/s

    EXECUTION
    iteration_duration.................: avg=8.96s    min=1.23s   med=8.64s    max=21.71s   p(90)=13.52s   p(95)=15.1s    p(99)=17.13s  
    iterations.........................: 1342   8.994617/s
    vus................................: 1      min=1         max=100
    vus_max............................: 100    min=100       max=100

    NETWORK
    data_received......................: 207 MB 1.4 MB/s
    data_sent..........................: 1.0 MB 7.0 kB/s



running (2m29.2s), 000/100 VUs, 1342 complete and 0 interrupted iterations
default ✓ [ 100% ] 000/100 VUs  2m20s